In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame(
{"a" : [1,1,1],
"b" : [2,3,4],
"c" : [3,2,1],
"d" : [2,3,2]},
index = [1,2,3])

In [5]:
df1

   a  b  c  d
1  1  2  3  2
2  1  3  2  3
3  1  4  1  2

In [15]:
df2 = pd.DataFrame(
{"a" : [1,1,1],
"b" : [2,3,4],
"c" : [3,2,1]},
index = [1,2,3])

In [16]:
df2=df2.rename(columns={
    'a' : 'aa',
    'b' : 'bb',
    'c' : 'cc'
})

In [17]:
df1*df2  #all na coz col names do not match

    a  aa   b  bb   c  cc   d
1 NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN

In [18]:
x=pd.melt(df2) # cols to rows
x

  variable  value
0       aa      1
1       aa      1
2       aa      1
3       bb      2
4       bb      3
5       bb      4
6       cc      3
7       cc      2
8       cc      1

In [19]:
x.pivot(columns='variable', values='value')  #rows to cols

variable   aa   bb   cc
0         1.0  NaN  NaN
1         1.0  NaN  NaN
2         1.0  NaN  NaN
3         NaN  2.0  NaN
4         NaN  3.0  NaN
5         NaN  4.0  NaN
6         NaN  NaN  3.0
7         NaN  NaN  2.0
8         NaN  NaN  1.0

In [25]:
df1

   a  b  c  d
1  1  2  3  2
2  1  3  2  3
3  1  4  1  2

In [20]:
y = pd.DataFrame({
    "a" : [1,2,3],
    "b" : [1,2,1],
    "c" : [1,1,1]},
    index=[1,2,3])

In [21]:
y

   a  b  c
1  1  1  1
2  2  2  1
3  3  1  1

In [35]:
pd.concat([df1,y])  #union all

C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

   a  b  c    d
1  1  2  3  2.0
2  1  3  2  3.0
3  1  4  1  2.0
1  1  1  1  NaN
2  2  2  1  NaN
3  3  1  1  NaN

In [36]:
pd.concat([df1,y], axis=1)

   a  b  c  d  a  b  c
1  1  2  3  2  1  1  1
2  1  3  2  3  2  2  1
3  1  4  1  2  3  1  1

In [37]:
df1

   a  b  c  d
1  1  2  3  2
2  1  3  2  3
3  1  4  1  2

In [39]:
df1.sort_values('c')

   a  b  c  d
3  1  4  1  2
2  1  3  2  3
1  1  2  3  2

In [49]:
z=df1.sort_values('d',ascending=False)
z

   a  b  c  d
2  1  3  2  3
1  1  2  3  2
3  1  4  1  2

In [50]:
z.reset_index()

   index  a  b  c  d
0      2  1  3  2  3
1      1  1  2  3  2
2      3  1  4  1  2

In [73]:
df1.sample(frac=0.5)  # random sampling

   a  b  c  d
2  1  3  2  3
3  1  4  1  2

In [77]:
df1.sample(n=2)   # random sampling

   a  b  c  d
3  1  4  1  2
1  1  2  3  2

In [117]:
df1.nlargest(2,'b')  # top 2 in col b

   a  b  c  d
3  1  4  1  2
2  1  3  2  3

In [80]:
df1.nsmallest(1,'b')  # smallest 2 in col b

   a  b  c  d
1  1  2  3  2

In [88]:
df1.iloc[:,[3,1,2]]

   d  b  c
1  2  2  3
2  3  3  2
3  2  4  1

In [99]:
df1.iloc[:,0:2]

   a  b
1  1  2
2  1  3
3  1  4

In [96]:
df1.a.isin([2,3])

1    False
2    False
3    False
Name: a, dtype: bool

In [97]:
df1[['a','b']]

   a  b
1  1  2
2  1  3
3  1  4

In [103]:
df1.loc[:,['b','b']]

   b  b
1  2  2
2  3  3
3  4  4

In [105]:
df1.loc[df1['b']>2,['a','c']]

   a  c
2  1  2
3  1  1

In [112]:
df1['d'].value_counts()

2    2
3    1
Name: d, dtype: int64

In [114]:
len(df1['a'])   # number of records

3

In [115]:
df1['a'].nunique() # number of unique records

1

In [117]:
df1.describe()

         a    b    c         d
count  3.0  3.0  3.0  3.000000
mean   1.0  3.0  2.0  2.333333
std    0.0  1.0  1.0  0.577350
min    1.0  2.0  1.0  2.000000
25%    1.0  2.5  1.5  2.000000
50%    1.0  3.0  2.0  2.000000
75%    1.0  3.5  2.5  2.500000
max    1.0  4.0  3.0  3.000000

In [22]:
df=pd.concat([df1,y])
df

C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

   a  b  c    d
1  1  2  3  2.0
2  1  3  2  3.0
3  1  4  1  2.0
1  1  1  1  NaN
2  2  2  1  NaN
3  3  1  1  NaN

In [132]:
df['d'].fillna("no_value")

1           2
2           3
3           2
1    no_value
2    no_value
3    no_value
Name: d, dtype: object

In [159]:
df.groupby('a').mean()

     b     c         d
a
1  2.5  1.75  2.333333
2  2.0  1.00       NaN
3  1.0  1.00       NaN

In [28]:
df.loc[df['b']==2,('a','b')]

   a  b
1  1  2
2  2  2

In [29]:
df.loc[df['b']==2]

   a  b  c    d
1  1  2  3  2.0
2  2  2  1  NaN

In [36]:
df.loc[(df['b']==2) & (df['d']!=2)]

   a  b  c   d
2  2  2  1 NaN

In [37]:
df[df.d.isnull()]

   a  b  c   d
1  1  1  1 NaN
2  2  2  1 NaN
3  3  1  1 NaN

In [38]:
df.d.isnull()

1    False
2    False
3    False
1     True
2     True
3     True
Name: d, dtype: bool

In [40]:
df.b.clip(lower=1,upper=2)

1    2
2    2
3    2
1    1
2    2
3    1
Name: b, dtype: int64

In [41]:
df.b.clip(lower=1,upper=3)

1    2
2    3
3    3
1    1
2    2
3    1
Name: b, dtype: int64

In [42]:
max(df['b']) #min(df['b'])

4L

In [44]:
df

   a  b  c    d
1  1  2  3  2.0
2  1  3  2  3.0
3  1  4  1  2.0
1  1  1  1  NaN
2  2  2  1  NaN
3  3  1  1  NaN

In [43]:
df.b.cumsum()

1     2
2     5
3     9
1    10
2    12
3    13
Name: b, dtype: int64

In [45]:
df.b.cummax()

1    2
2    3
3    4
1    4
2    4
3    4
Name: b, dtype: int64

In [46]:
df.b.cummin()

1    2
2    2
3    2
1    1
2    1
3    1
Name: b, dtype: int64

In [47]:
df.b.cumprod()

1     2
2     6
3    24
1    24
2    48
3    48
Name: b, dtype: int64

In [49]:
df.b.shift(1)

1    NaN
2    2.0
3    3.0
1    4.0
2    1.0
3    2.0
Name: b, dtype: float64

In [50]:
df.b.shift(-1)

1    3.0
2    4.0
3    1.0
1    2.0
2    1.0
3    NaN
Name: b, dtype: float64

In [53]:
df

   a  b  c    d
1  1  2  3  2.0
2  1  3  2  3.0
3  1  4  1  2.0
1  1  1  1  NaN
2  2  2  1  NaN
3  3  1  1  NaN

In [52]:
df.b.rank(method='dense')

1    2.0
2    3.0
3    4.0
1    1.0
2    2.0
3    1.0
Name: b, dtype: float64

In [54]:
df.b.rank(method='min')

1    3.0
2    5.0
3    6.0
1    1.0
2    3.0
3    1.0
Name: b, dtype: float64

In [56]:
df.b.rank(method='first')

1    3.0
2    5.0
3    6.0
1    1.0
2    4.0
3    2.0
Name: b, dtype: float64

In [55]:
df.b.rank(pct=True)

1    0.583333
2    0.833333
3    1.000000
1    0.250000
2    0.583333
3    0.250000
Name: b, dtype: float64

In [62]:
df.expanding()

Expanding [min_periods=1,center=False,axis=0]

In [63]:
df1

   a  b  c  d
1  1  2  3  2
2  1  3  2  3
3  1  4  1  2

In [71]:
df3=df2.rename(columns={
    'aa':'a',
    'bb':'b',
    'cc':'c'})

In [77]:
df3=df3.cummin()
df3

   a  b  c
1  1  2  3
2  1  2  3
3  1  2  3

In [78]:
df1+df3

   a  b  c   d
1  2  4  6 NaN
2  2  5  5 NaN
3  2  6  4 NaN

In [84]:
pd.merge(df1, df3,            # joins
        how='inner', on='a')

   a  b_x  c_x  d  b_y  c_y
0  1    2    3  2    2    3
1  1    2    3  2    2    3
2  1    2    3  2    2    3
3  1    3    2  3    2    3
4  1    3    2  3    2    3
5  1    3    2  3    2    3
6  1    4    1  2    2    3
7  1    4    1  2    2    3
8  1    4    1  2    2    3

In [83]:
pd.merge(df1, df3,
        how='right', on='b')

   a_x  b  c_x  d  a_y  c_y
0    1  2    3  2    1    3
1    1  2    3  2    1    3
2    1  2    3  2    1    3

In [87]:
pd.merge(df1, df3,
        how='left', on='b')

   a_x  b  c_x  d  a_y  c_y
0    1  2    3  2  1.0  3.0
1    1  2    3  2  1.0  3.0
2    1  2    3  2  1.0  3.0
3    1  3    2  3  NaN  NaN
4    1  4    1  2  NaN  NaN

In [88]:
pd.merge(df1, df3,
        how='outer', on='b')

   a_x  b  c_x  d  a_y  c_y
0    1  2    3  2  1.0  3.0
1    1  2    3  2  1.0  3.0
2    1  2    3  2  1.0  3.0
3    1  3    2  3  NaN  NaN
4    1  4    1  2  NaN  NaN

In [90]:
df1

   a  b  c  d
1  1  2  3  2
2  1  3  2  3
3  1  4  1  2

In [91]:
df3

   a  b  c
1  1  2  3
2  1  2  3
3  1  2  3

In [94]:
df1[df1.b.isin(df3.c)]

   a  b  c  d
2  1  3  2  3

In [95]:
df1[~df1.b.isin(df3.c)]

   a  b  c  d
1  1  2  3  2
3  1  4  1  2

In [109]:
adf=pd.DataFrame(
    {'a':['x','y','z'],
    'b':['a','a','a'],
    'c':[1,2,3]},
index=[1,2,3])
adf

   a  b  c
1  x  a  1
2  y  a  2
3  z  a  3

In [110]:
bdf=pd.DataFrame(
    {'a':['z','b','c'],
    'b':['a','b','a'],
    'c':[1,5,3]},
index=[1,2,3])
bdf

   a  b  c
1  z  a  1
2  b  b  5
3  c  a  3

In [107]:
adf+bdf

    a   b  c
1  xz  aa  2
2  yb  ab  7
3  zc  aa  6

In [113]:
df1

   a  b  c  d
1  1  2  3  2
2  1  3  2  3
3  1  4  1  2

In [114]:
df3

   a  b  c
1  1  2  3
2  1  2  3
3  1  2  3

### Set Operators

In [115]:
pd.merge(df1,df3)  # Intersection

   a  b  c  d
0  1  2  3  2
1  1  2  3  2
2  1  2  3  2

In [116]:
pd.merge(df1, df3, how='outer')  # Union

   a  b  c  d
0  1  2  3  2
1  1  2  3  2
2  1  2  3  2
3  1  3  2  3
4  1  4  1  2